Revit 2015 API
ExporterIFCUtils.GetWallHeightDirection Method
 The direction of the wall.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015.  Walls in Revit all have the Z direction of (0,0,1).  Use that instead.")]
public static XYZ GetWallHeightDirection(
	Wall wall
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015.  Walls in Revit all have the Z direction of (0,0,1).  Use that instead.")> _
Public Shared Function GetWallHeightDirection ( _
	wall As Wall _
) As XYZ
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015.  Walls in Revit all have the Z direction of (0,0,1).  Use that instead.")]
public:
static XYZ^ GetWallHeightDirection(
	Wall^ wall
)
Parameters
wall
Type: Autodesk.Revit.DB.Wall
 The wall.
Return Value
 The direction of the wall.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace